app/Controllers/Alumnos.php

    public function index()
    {
        $resultado = $this->modelalumnos->findAll();
---
SELECT *
FROM `alumnos`