app/Controllers/Alumnos.php

SELECT *
FROM `alumnos`
WHERE `activo` = 1
---
    public function index($activo=1)
    {
        $resultado = $this->modelalumnos->where('activo',$activo)->findAll();

SELECT *
FROM `alumnos`
WHERE `idalumno` = '4'
 LIMIT 1
---
    public function editar($id){
        $resultado = $this->modelalumnos->where('idalumno',$id)->first();

UPDATE `alumnos` SET `activo` = 0
WHERE `alumnos`.`idalumno` IN ('13')
---
    public function actualizar(){
        $id = $this->request->getpost('idalumno');
        $valores = [
            'nombre' => $this->request->getpost('nombre'),
            'apellidos' => $this->request->getpost('apellidos'),
            'DNI' => $this->request->getpost('DNI'),
            'celular' => $this->request->getpost('celular')
        ];
        $this->modelalumnos->update($id,$valores);

SELECT *
FROM `alumnos`
WHERE `activo` = 0
---
    public function eliminados($activo=0)
    {
        $resultado = $this->modelalumnos->where('activo',$activo)->findAll();