app/Controllers/Cursos.php

    public function index($activo=1)
    {
        $resultado = $this->modelcursos->where('activo',$activo)->findAll();
---
SELECT *
FROM `cursos`
WHERE `activo` = 1

    public function editar($id){
        $resultado = $this->modelcursos->where('idcurso',$id)->first();
---
SELECT *
FROM `cursos`
WHERE `idcurso` = '1'
 LIMIT 1

    public function eliminados($activo=0)
    {
        $resultado = $this->modelcursos->where('activo',$activo)->findAll();
---
SELECT *
FROM `cursos`
WHERE `activo` = 0