app/Controllers/Inicio.php

SELECT *
FROM `alumnos`
---
    public function veralumnos()
    {
        $resultado = $this->modelalumnos->findAll();